documents/app/controllers/freelance_documents_controller.rb

SELECT "freelance_documents".* FROM "freelance_documents"
---
  def index
    @freelance_documents = FreelanceDocument.all

SELECT  "freelance_documents".* FROM "freelance_documents" WHERE "freelance_documents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_freelance_document
      @freelance_document = FreelanceDocument.find(params[:id])